src/DataProcessors/ЗагрузкаДоговорныхПозицийИзФайла/ЗагрузкаДоговорныхПозицийИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДоговорныхПозицийИзФайла</name>
</mdclass:DataProcessor>

src/InformationRegisters/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорныеПозиции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорнаяПозиция</name>
    <type>
      <types>CatalogRef.ДоговорныеПозиции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолнНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобаяОтметка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаКодов</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗагрузкаДоговорныхПозицийИзФайла/Forms/Форма/Module.bsl
&НаСервере
Процедура ДобавитьМПЗ(Договор,МПЗ,Количество,Цена,Валюта,ДатаПоставки)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорныеПозиции.Ссылка
	|ИЗ
	|	Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
	|ГДЕ
	|	ДоговорныеПозиции.Владелец = &Владелец
	|	И ДоговорныеПозиции.МПЗ = &МПЗ";
Запрос.УстановитьПараметр("Владелец", Договор);
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДП = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	Иначе
	ДП = Справочники.ДоговорныеПозиции.СоздатьЭлемент();
	ДП.Владелец = Договор;
	ДП.МПЗ = МПЗ;
	ДП.Записать();	
	КонецЕсли; 
ДоговорныеПозиции = РегистрыСведений.ДоговорныеПозиции.СоздатьМенеджерЗаписи();
ДоговорныеПозиции.Период = ДатаПоставки;
ДоговорныеПозиции.ДоговорнаяПозиция = ДП.Ссылка;
ДоговорныеПозиции.Количество = Количество;
ДоговорныеПозиции.Цена = Цена;
ДоговорныеПозиции.Валюта = Валюта;
ДоговорныеПозиции.ОстатокПоДоговору = Количество;
ДоговорныеПозиции.Записать(Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьМПЗ(Наименование)
	Если ВидМПЗ = 1 Тогда
	Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина));
	Иначе	
	Возврат(Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина));
	КонецЕсли; 
КонецФункции

&НаСервере
Функция ПолучитьКонтрагента(Наименование)
Возврат(Справочники.Контрагенты.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция ПолучитьДоговор(Контрагент,Наименование,НаименованиеВалюты)
Выборка = Справочники.Договоры.Выбрать(,Контрагент,Новый Структура("Наименование",Наименование));
	Пока Выборка.Следующий() Цикл
	Возврат(Выборка.Ссылка);	
	КонецЦикла;
Договор = Справочники.Договоры.СоздатьЭлемент();
Договор.Владелец = Контрагент;
Договор.Наименование = Наименование;
Договор.Валюта = Справочники.Валюты.НайтиПоНаименованию(НаименованиеВалюты,Истина);
Договор.Записать();
	Если Контрагент.ОсновнойДоговор.Пустая() Тогда
	Контр = Контрагент.ПолучитьОбъект();
	Контр.ОсновнойДоговор = Договор.Ссылка;
	Контр.Записать();	
	КонецЕсли; 
Возврат(Договор.Ссылка);
КонецФункции

&НаСервере
Функция ПолучитьВалюту(Наименование)
Возврат(Справочники.Валюты.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда) 
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c договорными позициями");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка договорных позиций из файла..."); 
		НаименованиеМПЗ = СокрЛП(ExcelЛист.Cells(к,1).Value);
		МПЗ = ПолучитьМПЗ(НаименованиеМПЗ);
			Если Не МПЗ.Пустая() Тогда
			НаименованиеКонтрагента = СокрЛП(ExcelЛист.Cells(к,2).Value);
			Контрагент = ПолучитьКонтрагента(НаименованиеКонтрагента);
				Если Не Контрагент.Пустая() Тогда
				НаименованиеДоговора = СокрЛП(ExcelЛист.Cells(к,3).Value);
				Договор = ПолучитьДоговор(Контрагент,НаименованиеДоговора,СокрЛП(ExcelЛист.Cells(к,4).Value));
				Валюта = ПолучитьВалюту(СокрЛП(ExcelЛист.Cells(к, 7).Value));
					Если Не Валюта.Пустая() Тогда
						Попытка
						ВыбДата = Строка(ExcelЛист.Cells(к,8).Value);
						ДатаНачалаПоставки = Дата(Число(Сред(ВыбДата,7,4)),Число(Сред(ВыбДата,4,2)),Число(Сред(ВыбДата,1,2)));
						ДобавитьМПЗ(Договор,МПЗ,ExcelЛист.Cells(к,5).Value,ExcelЛист.Cells(к,6).Value,Валюта,ДатаНачалаПоставки);
						Исключение
						Сообщить(ОписаниеОшибки());
						Прервать;
						КонецПопытки;
					Иначе
					Сообщить(СокрЛП(ExcelЛист.Cells(к, 7).Value) + " - валюта не найдена!");
					КонецЕсли; 
				Иначе
				Сообщить(НаименованиеКонтрагента + " - контрагент не найден!");
				КонецЕсли;
			Иначе
			Сообщить(НаименованиеМПЗ + " - МПЗ не найден!");
			КонецЕсли; 
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидМПЗ = 1;
КонецПроцедуры
